monsonite/SIMPL/SIMPLEX_2_MSP430FR2433_11.c
#include <msp430.h> 
// SIMPLEX 2_MSP430FR2433_11

// SIMPL Interpreter for MSP430FR2433 ChipStick V2.11

// - inspired by Txtzyme Nano Interpreter -  an original idea by Ward Cunningham

// An on going Neo-Retro Computing Mission!

// Ken Boak  March 28th 2016

// This version works with 23LC1024  128Kbyte SRAM



// Modified 18-3-2016 to run on MSP430FR2433 Module and on 23-3-2016 to run on ChipStick

// This version adds 23LC1024 128Kx8 external SPI RAM, plus hex-dump utlity

// RAM connections
/*

                   +------U------+
1             3V3  |  CHIPSTICK  | 0v                20
2             P3.2 |             | P2.1 XIN          19
3      PC-RX  P1.5 |             | P2.0 XOUT         18
4      PC-TX  P1.4 |             | TEST/SBWTXK       17
5  UCA0 CLK   P1.6 |             | /RST/NMI/SBWTDIO  16
6             P2.3 |             | UCA1 MOSI         15
7  RAM_/CS    P3.0 |             | UCA1 MISO         14
8  UCB0 STE   P1.0 |             | UCA1 CLK          13
9  UCB0 SCK   P1.1 |             | P2.3              12
10 UCB0 MOSI  P1.2 |             | P1.3 UCB0 MISO    11
                   +-------------+

                   +------U------+
P3.0  /CE          |   23K256    | 3V3
P1.3  MISO         |             | HOLD - pull up to 3V3
      NC           |             | SCK  - P1.1
      0V           |             | MOSI - P1.2
                   +-------------+
*/
// Timing

// 1,000,000 empty loops in 2.4uS per iteration
// 100,000,000 empty loops in 2.4uS per iteration

//#include <MSP430FR4133.h>
#include <MSP430FR2433.h>

#define HIGH 0x01
#define LOW  0x00

#define        RXD	           BIT5                // Receive Data (RXD) at P1.1
#define        TXD	           BIT4                // Transmit Data (TXD) at P1.2
#define        RED             0x40                // Red LED is on Bit 7
#define        GREEN           0x01                // Green LED is on Bit 0
//#define        SS_PIN          BIT4              // CS , active low
#define        SS_PIN          BIT0                // CS , active low  Port 3.0
//#define        DEBUG_PIN       BIT0                // toggle on and off marking time to write
#define        DUMMY_BYTE      0xFF                // byte we send when we just want to read slave data
//#define        ssSelect        P1OUT &= ~SS_PIN
//#define        ssDeselect      P1OUT |= SS_PIN
#define        ssSelect        P3OUT &= ~SS_PIN
#define        ssDeselect      P3OUT |= SS_PIN

#define delay_1ms __delay_cycles(16000)
#define bufRead(addr)       (*(unsigned char *)(addr))
#define bufWrite(addr, b)   (*(unsigned char *)(addr) = (b))
#define bit0 0x01   // 1
#define bit1 0x02   // 2
#define bit2 0x04   // 4
#define bit3 0x08   // 8
#define bit4 0x10   // 16
#define bit5 0x20   // 32
#define bit6 0x40   // 64
#define bit7 0x80   // 128
#define SR_WRITE_STATUS 0x01
#define SR_WRITE        0x02
#define SR_READ         0x03
#define SR_READ_STATUS  0x05
#define BYTES_TO_STREAM 1024     // should be less <= 32768
#define PATTERN_BYTE_VALUE 65

//---------------------------------------------------------------------------------
// LCD defines

#define pos1 4                                                 // Digit A1 - L4
#define pos2 6                                                 // Digit A2 - L6
#define pos3 8                                                 // Digit A3 - L8
#define pos4 10                                                // Digit A4 - L10
#define pos5 2                                                 // Digit A5 - L2
#define pos6 18                                                // Digit A6 - L18

const char digit[96] =                                        // Array to hold digits, upper case alpha and punctuation
{
    0xFC,                                                      // "0"
    0x60,                                                      // "1"
    0xDB,                                                      // "2"
    0xF3,                                                      // "3"
    0x67,                                                      // "4"
    0xB7,                                                      // "5"
    0xBF,                                                      // "6"
    0xE4,                                                      // "7"
    0xFF,                                                      // "8"
    0xF7                                                       // "9"
};
//---------------------------------------------------------------------------------

static inline char RWData(char value);
int spi_rx_data = 0 ;

static inline char RAMData(char value)
{
	return  spi_rx_data;
}


//-----------------------------------------------------------------
// This character array is used to hold the User's words - on the '24333 we have 4K bytes of RAM

// These are test lines - for performing various RAM tests

char array[26][32] =      {
                         {"_Hello World, welcome to SIMPL_"},
                         {"_Mary had a Little Lamb_"},
                         {"_This is a test message_"},
                         {"_Hickory, Dickory Dock_"},
                         {"_twas brillig slithy toves_"},
                         {"11{kp_ Green Bottles_}"}

                         };

    char buf[64];                          // Buffer to hold users keyboard entry
    char num_buf[11];                      // long enough to hold a 32 bit long
    char block_array[64];                  // Used to transfer bytes from external RAM and execute x-code

    unsigned long x = 0;                // Three gen purpose variables for stack & math operations
    unsigned long y = 0;
    unsigned int  z = 0;
    unsigned int ADC_value=0;

    int hex_value = 0;
    int dec_value = 0;
    int decimal_value = 0;
    char ha = 0;
    char hex_char;

    unsigned char in_byte;

    int len = 32;                        // the max length of a User word
    int length = 0;                      // number of bytes to red/write to SRAM
    int address = 0 ;                    // starting address of RAM R/W streamms
    int RAM_byte =0;                     // contents of RAM at given location
    long old_millis=0;
    long new_millis=0;
    unsigned long time = 0;
    char  name;
    char* parray;
    char* px_array;
    char* addr;
    char mode = 0x41;                  // Sequential mode for SRAM

    unsigned int num = 0;
    unsigned int num_val = 0;
//    int i;
    int j;
    int l;


