monsonite/SIMPL/SIMPLEX_2_MSP430FR2433_11.c
 int ADC_Read(void)
 {
   ADC10CTL0 |= ENC + ADC10SC;			// Sampling and conversion start
   ADC_value = ADC10MEM;
   return ADC_value;
 }
*/
//-------------------------------------------------------------------------------------
// mS delay routine

void delay_uS(int i)
{
//   volatile unsigned long i;

                   	         // Delay
   	   do (i--);
       while (i != 0);	        // busy waiting (bad)

}

void delay_mS(long i)
{
                    	         // Delay
   	  while(i)
   	   {
   		 uart_putc('.');
   		 i--;
   	   }
           	        // busy waiting (bad)
  }

//-------------------------------------------------------------------------------------

int DigitalRead (int Pin)
{
P1DIR |= 0x01; // Set P1.0 to output direction
Pin & P1IN;
return (Pin & P1IN);
}
//-------------------------------------------------------------------------------------

void DigitalWrite(int Pin,int Value)
{
 P1DIR=Pin;
 if (Value==HIGH){
 P1OUT=Pin;}
 if (Value==LOW){
 P1OUT &=~Pin;}
}

//-------------------------------------------------------------------------------------

void Toggle(int Pin)
{
 P1DIR |=Pin;
 P1OUT ^= Pin;
}

//-------------------------------------------------------------------------------------

void SerialWaitChar()
{
while ((BIT2 & P1IN)!=0){} //Wait for RX-BIT2 to be High from Serial in
}



//---------------------------------------------------------------------------------

int main(void)
{
	// Initialise '2433

	WDTCTL = WDTPW | WDTHOLD;                // Stop watchdog timer


  PM5CTL0 &= ~LOCKLPM5;                    // Disable the GPIO power-on default high-impedance mode
                                           // to activate 1previously configured port settings

  __bis_SR_register(SCG0);                 // disable FLL
  CSCTL3 |= SELREF__REFOCLK;               // Set REFO as FLL reference source
  CSCTL0 = 0;                              // clear DCO and MOD registers
  CSCTL1 &= ~(DCORSEL_7);                  // Clear DCO frequency select bits first
  CSCTL1 |= DCORSEL_3;                     // Set DCO = 8MHz
  CSCTL2 = FLLD_0 + 243;                   // DCODIV = 8MHz
  __delay_cycles(3);
  __bic_SR_register(SCG0);                 // enable FLL
  while(CSCTL7 & (FLLUNLOCK0 | FLLUNLOCK1)); // Poll until FLL is locked

  CSCTL4 = SELMS__DCOCLKDIV | SELA__REFOCLK; // set default REFO(~32768Hz) as ACLK source, ACLK = 32768Hz
                                           // default DCODIV as MCLK and SMCLK source


/*
// --------------------------------------------------------------------------------------------------------------------
	// Initialise '4133

        WDTCTL  = WDTPW + WDTHOLD; 	             // Stop WDT

        PM5CTL0 &= ~LOCKLPM5;                       // Disable the GPIO power-on default high-impedance mode

//        Serial.begin(100000);                        // initialises timing functions

//	BCSCTL1 = CALBC1_1MHZ;                       // Set DCO
//  	DCOCTL  = CALDCO_1MHZ;
	P1DIR  = BIT0 + BIT6; 		              // P1.0 and P1.6 are the red+green LEDs
	P1OUT  = BIT0 + BIT6; 		              // All LEDs off

	*/

// --------------------------------------------------------------------------------------------------------------------

        // Configure GPIO
         GPIO_init_2433();

        // uart_init_4133();                                  // Initialise the '4133 UART for 96000 baud
		 uart_init_2433();

       // spi_init_4133();                                   // Initialise the '4133 SPI on USCIB  8MHz clock, master mode
	    spi_init_2433();

	    uart_putc(10);
	    uart_putc(13);

        uart_puts((char *)"SIMPLEX V2.11 FOR MSP430FR2433 \n\r");      // send opening banner message



        spi_check();                       // Make sure SPI RAM is connected and in the correct streaming mode

        P3DIR  |= BIT1| BIT2;
        P3OUT  |= BIT1; 		          // GREEN LED is on P3.1
        P3OUT  &= ~BIT2;

        P3OUT  |= BIT1; 				  // Flash LED twice
        delay_mS(100);
        P3OUT  &= ~BIT1;
        P3OUT  |= BIT1;
        delay_mS(100);
        P3OUT  &= ~BIT1;

 //       P1SEL |= BIT3;	                              // ADC input pin P1.3
        //ADC_init_4133();

		ADC_init_2433();

        WDTCTL = WDTPW + WDTTMSEL + WDTIS1;            // enable watchdog - interval mode
        parray = &array[0][0];                        // parray is the pointer to the first element of code buffer
        px_array = &block_array[0];                   // px_array is pointer to first element of RAM transfered block array
//       delay(1);
//        time = micros();
//        printlong(time);                 // used for timing functions

        print_ok();
        crlf();

//        LCD_print_4133();

//-------------------------------------------------------------------------------
// Interpreter Loop
  while(1)
  {

  textRead(buf, 64);                     // This is the endless while loop which implements the SIMPL interpreter - just 3 simple functions
  textChk(buf);                          // check if it is a : character for beginning a colon definition
  textEval(buf);

  }   // end of interpreter loop

}    // End of main

//-------------------------------------------------------------------------------
// Language Functions  - Words
// ------------------------------------------------------------------------------

//  Read the character into the buffer

void textRead (char *p, char n) {
  char i = 0;
  while (i < (n-1)) {
    char ch = uart_getc();
    if (ch == '\r' || ch == '\n') break;
    if (ch >= ' ' && ch <= '~') {
      *p++ = ch;
      i++;
    }
  }
  *p = 0;
}

// ---------------------------------------------------------------------------------------------------------
void textChk (char *buf)       // Check if the text starts with a colon and if so store in user's word RAM array  parray[]
{
  if (*buf == ':')  {
  char ch;
  int i =0;
  while ((ch = *buf++)){

  if (ch == ':') {
  uart_putc(*buf);   // get the name from the first character
  uart_putc(10);
  uart_putc(13);
  name = *buf ;
  buf++;
  }

  bufWrite((parray + (len*(name-65) +i)),*buf);

  i++;

