monsonite/SIMPL/SIMPLEX_2_MSP430FR2433_11.c
static inline void SR_readstream(unsigned long addr) {             // Read a stream from 23LC1024
    ssDeselect;
    ssSelect;
    RWData(0x03);                                           // Send command
    RWData(addr >> 16);                                     // Send upper address
    RWData(addr >> 8);                                      // Send middle address
    RWData(addr);                                           // Send lower address
}

//-----------------------------------------------------------------
// SPI Send / Receive

static inline char RWData(char value)
{
    UCB0TXBUF = value;

      while (!(UCB0IFG & UCTXIFG)) {};        // wait for buffer ready

    while  (!(UCB0IFG &   UCRXIFG));        //  USCI_B0 RX  Received?
    spi_rx_data    =   UCB0RXBUF;          //  Store received data
    return  spi_rx_data;
}


char RAM_stream_mode()
{

    ssDeselect;
    delay_1ms;

        char chipMode;

        chipMode = SR_getMode();    // check status register for sequential mode
        if (chipMode != 0x41) {
            SR_setMode(0x41);
             return 0;
        }
        return 1;
       }
//---------------------------------------------------------------------------
// Check that the external RAM is present and that it is in Sequential Mode
int spi_check()

{
        ssDeselect;
        delay_1ms;
        char chipMode;

        // make sure there is a 23LC1024 chip and that
        // is wired properly and in sequential mode

        chipMode = SR_getMode();
        if (chipMode != 0x41)
        {
            SR_setMode(0x41);
            uart_puts((char *)"SPI RAM not found\n\r");
        }
        else
        {
        uart_puts((char *)"128K SPI RAM Connected!\n\r");
        }
}

//--------------------------------------------------------------------------
// RAM mode
// Where mode =
// 0x01  Byte Mode
// 0x81  Page Mode           (Page = 32 bytes)
// 0x41  Sequential Mode
//--------------------------------------------------------------------------

char RAM_byte_mode(char mode)          // Set the RAM into the correct mode
{
        ssDeselect;
        char chipMode;

        chipMode = SR_getMode();       // check status register for byte mode
        if (chipMode != mode) {
        SR_setMode(mode);
        return 0;
        }
        return 1;
}

// -----------------------------------------------------------------------------
//spi_load()- load the RAM from address with "initial orders"  characters
// -----------------------------------------------------------------------------

void spi_load(unsigned long address, int length )                 // fill
{
    unsigned int i;
    char storedValue = 0;
    RAM_stream_mode();
    SR_writestream(address);                                 // start writing at address

    for(j=0; j<26; j++)
    {
    for (i = 0; i < 32; ++i)
    {
    storedValue =  (array[j][i]);
    RWData(storedValue);
    }
    }

}

// -----------------------------------------------------------------------------
//spi_fill()- fill the RAM from address with AA test characters
// -----------------------------------------------------------------------------

void spi_fill(unsigned long address, int length )                 // fill
{
 //   unsigned int i;
    char storedValue = 0xAA;
    RAM_stream_mode();
    SR_writestream(address);                                 // start writing at address

    for(j=0; j<length; j++)

    {
//    storedValue =  (array[j][i]);
    RWData(0xAA);
    }


}

//-----------------------------------------------------------------------------------------

void put_block(int address)
{

    unsigned int i;
    char storedValue = 0;
    RAM_stream_mode();
    SR_writestream(address);                                 // start writing at address

    for (i = 0; i < 64; ++i)
    {
    storedValue = (buf[i]);                                 // copy key buffer to RAM block
    if(storedValue != 92)                                   // omit opening \ and closing \
    {
    RWData(storedValue);
    uart_putc(storedValue);
    }
    }


// -----------------------------------------------------------------------------
// dump the characters from RAM to screen - putting a newline every 64 bytes
// -----------------------------------------------------------------------------

void dump(int address, int length)

{
  int i =0;

     crlf();                         // Start with a newline!

    RAM_stream_mode();
    SR_readstream(address); // start reading at address 0
    for (i = 0; i < length ; ++i)

       {
       if(i%32 == 0)
       {
         crlf();                       // put a newline every 32 chars

         printlong(i+ address);                          // print the line address followed by four spaces
         uart_putc(0x20);
         uart_putc(0x20);
         uart_putc(0x20);
         uart_putc(0x20);
       }

       RAM_byte = RWData(DUMMY_BYTE);
       if(RAM_byte <= 31) {RAM_byte =  '.';}      // Make it a full stop for unprintable characters
       uart_putc(RAM_byte);
}

}

//--------------------------------------------------------------------------------------------
// Generate a familiar hex dump of the RAM area

void hex_dump(unsigned long address, int length)

{
  crlf();                          // Start with a newline!

  int i =0;
  SR_readstream(address); // start reading at address 0

  for (j = address >>5; j < (address + length)>> 5 ; j++)
  {
    for (i = 0; i < 32 ; ++i)
       {
       if(i== 0)
       {
         hex_print_4(j<<5);                          // print the line address as HEX  followed by 2 spaces
         uart_putc(0x20);
         uart_putc(0x20);
         uart_putc('[');
         printlong(j);							// Print the block number in decimal - for convenience
         uart_putc(']');
         uart_putc(0x20);
         uart_putc(0x20);
       }

       RAM_byte = RWData(DUMMY_BYTE);             // Now read and print the data as numbers
      // printlong(RAM_byte);
       hex_print_2(RAM_byte);

       block_array[i] = RAM_byte;                 // block_array is a temporary buffer to hold current RAM block
       uart_putc(0x20);                           // followed by a space
       }

